{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-CNN_detector_BHTrackVeto_EMultr_1000epochs_small3","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,7,7,1],"dtype":"float32","sparse":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7,7,1]},"name":"conv_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7,7,1],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5,5,3]},"name":"conv_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5,5,3],"dtype":"float32","keras_history":["conv_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3,3,3]},"name":"conv_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3,3,3],"dtype":"float32","keras_history":["conv_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Flatten","config":{"name":"flatten","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,1,1,3]},"name":"flatten","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,1,1,3],"dtype":"float32","keras_history":["conv_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":6,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3]},"name":"dense_layer_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3],"dtype":"float32","keras_history":["flatten",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":6,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,6]},"name":"dense_layer_2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,6],"dtype":"float32","keras_history":["dense_layer_1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,6]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,6],"dtype":"float32","keras_history":["dense_layer_2",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[7,7,1]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[7,7,1],"values":["P3uSv+43er5FMIk+t3cVP8STmj82ylA/0wHkPwWrnz/sUPe+sIYOPhmp8L6klOo+PQ8uwAduCb+xNsu++qxdP4B/F8Dyw1W9XZnuPggxlr+JnKo/7oEiP/ZmEr8ImHU/ILkUPuCgzL1TQpc/ThDtvNmLaD+P/7M/31huP9ILBj5Xqm+/ZRGjv31vjj+0bUC/c9sCQIO4Lz6ReKu+We+rv7NxzT8qILm9dWSFvo+XwD68kjC/sqJQPyFRhL+4Dh899CVNPg=="]}],"outputs":[{"shape":[3],"values":["IK0LOibgxDqmen8/"]}]}],"trainable_params":{"conv_layer0":{"weights":["JvQ7vzCr3L/zIB29JRmBP0r6eD9kDiZA+Xs3wlj6hj93aN++n80uvq+jTL08zoI+VkEfP72vvkBy2BFATBu9QAYq1j/mEyq+unYSwbfV4cHrPUbBl5K3vWusFUBCkBnCErJuwZEejcDmNRA/"],"bias":["nBgMPcOdxDskX1k8"]},"conv_layer1":{"weights":["UHeEvyj0f76ZegJAT/1TPtSU/r0rlTY8bo0EwOY9DT7EnE1AcWjUvxzoGz+dDDc+hvoFvpl0nz9+CmW/kcgbv/UUH78qiw5AaxoEwC+9r77vY/a+Nwt9PpI3Rj9luhc+ElV4v0Uy3z4cBts+ItjfPjwG2r+m1U9AG5lEP7HygL+r2YTAO56KPXW2GT/DLac/U4pvP0+sNT/+t3k/rZmDvmbfJL4qEYK/bKK+vp4jZL4L8a6+VOgnPziIJb4vq08/fpGAvn3HhD5Lno2/bXMfwC6kyj8G650+T06DPgbI7z55SP4+S+Puva4L/T6mHo8+OHPgv6M30z9h/gBAuLKRPaZjgj4xY8C+GrZAPTZhk7/E9kA/7OPJP8c3nr4wRVG/tKrnvLVWUsB0EbY/B7UmP0l/Z76INqA+yOuFP6U2zz/Y+AE/"],"bias":["3Q+dPtNTIj5N6KK9"]},"conv_layer2":{"weights":["H8KyPd7Gsr6pJAI+ZTZevpLWHr5eaSY+ZSCTvTVFm75pbPY9TcXovU0RQz6iKkc9tVQWPgFUwb4f8DG+sjSXvtOzNL6c+uC9Cg/eviBYtj2TGik+J9wHPgZPCL7+DlS+6EHgPSzpEj3GxIQ+NSXmPsDtRT9lM0i/UUJaP0Kfjz/jpjzABYLNPsY/oj5dxqA+zPjQPk46zr7B/v6/HyGFv1jONr+yYn+9eeiSPuPAR7289jk/zScgwKyF1D+pEtO+0J0Bv27fPD/VhKu899UTP2Ol5z4Oc+6+lD36v5HyFT4WvAg/wWALwK6rCz1M0KK+Bd5NP2QGTb9PiDs/n2LSv1M3IT/JvJk/aE5AP9snlb94idW9Dp+WP3zCBj0//q++rVBRv16oXz/m6dA+F0/OP99bez7e1sS/KlMAQJzUhj+GXfW/"],"bias":["e+DBve1Snj2Ruyc+"]},"dense_layer_1":{"weights":["8tMpPIAVnr6t/sS9PWirvq55y71eqzk/q+Lavvxvkz/aTt8/1r6rvtp6pT+ID40/vMoXQKt2rb5QzSvAgOjBvMC+4z9Ay1g/"],"bias":["Owk5PuqBZz/TG8W9AAAAAAkIQb8y0kW7"]},"dense_layer_2":{"weights":["9LoxPuE0mr82wQVAI2C4P1c3PT1r99m+4OmuPuB71z/hHKG/FfsBPWxz4L0ZDqI/VrU8P7TF3z/9Bu0+dmypv0OZ5z5FOdS/vYooP2iFCr87yge/qiSfPuvYBz/Asre99/KwP4GKqb8ZNxc/JMMjv53fOD6nY1e/Zq+XP4jzhr8zOC8/h1sDP8ocKL9Y+cm/"],"bias":["dUipvtryrz7LmRm+cSHfPi3sxLwvgoU/"]},"output":{"weights":["8ptbv61OlD8c1Ci/pxkHQDJTr7/1+Y0+w3izwBk8hT4cxnM/0tIIQCRXUL9tlBm/IVt7vAb2xb6+44M+vvpfwCnNaT/TmgxA"],"bias":["UxjAvfQfBL+GV9c+"]}},"hash":"00e5e1ec99aef493c4bf62b4d015570e756292f68c744dddd0a1a96319006864"}