{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-CNN_detector_2017RunBand2018RunB_testROC_1500epochs_small3","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,7,7,1],"dtype":"float32","sparse":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7,7,1]},"name":"conv_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7,7,1],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5,5,3]},"name":"conv_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5,5,3],"dtype":"float32","keras_history":["conv_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3,3,3]},"name":"conv_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3,3,3],"dtype":"float32","keras_history":["conv_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Flatten","config":{"name":"flatten","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,1,1,3]},"name":"flatten","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,1,1,3],"dtype":"float32","keras_history":["conv_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":6,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3]},"name":"dense_layer_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3],"dtype":"float32","keras_history":["flatten",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":6,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,6]},"name":"dense_layer_2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,6],"dtype":"float32","keras_history":["dense_layer_1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,6]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,6],"dtype":"float32","keras_history":["dense_layer_2",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[7,7,1]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[7,7,1],"values":["/IfMv4C7wz7e14c+1TRWP8g/4L7fND8/ufcHvYZxob8fozY+J+rlvmT+uj9EhgC+H3PTvUlYoT9FWQ8/xcctP/9F2L2M5BQ/mL6dPqH6o7/m36g/xW8jPpDOlD/iVXW/HYWsP6Picr/dYJ4/RlajP8VtyD9VgKK+JprMvjDB9r7kjaM9SoQoPji90r7mcGI+RoqhP3gpWL+weHm+5/W1v8j4U76/jDs+Ay0+QN4qmT6mLQs+U7DOv2C2xjyDLU0+K9AOQA=="]}],"outputs":[{"shape":[3],"values":["AACAPwAAAAAAAAAA"]}]}],"trainable_params":{"conv_layer0":{"weights":["hWRuQKo1UL9RWaG/ppAkP72hkL90l1o/81F3v0pCiD/zsVLCrBCmQHAYuUD00Og+hQpUQL8h9z6Uze0/MFBrQNLdQ0DZd+q9Hg2aPtXR2T8gboI9dw0hwIDsTL4AljC/UXJ8v9QbX78lswzA"],"bias":["fKclPZUfFTwRqfA9"]},"conv_layer1":{"weights":["Mz8KQNy5A8D/M9k+qqLxv1B4gr7kn9A+sqsHQAVsNL9+zvg+BBl3vgmqwr4HVpk/IQG5vnEPAL4E9TS+LpWQPvG/8DwyfwrACdT5vnkFKL84lSG/yAVZwH9PBz4rD3+/CFveu7CZKz85sLk/EaftPWVrZ8B+yM09jtY2v33iz7+tyRC+/p0yv1NyhD9P/mE/ClMDv6otjL+PdN6+Oi5/Pi5sBr4C4xU/jE6Kv0iGFT/VFJq/L30OwH2u7T2yM5w/BAbyvQRNRT5o/8E+/Aetv/qGHj+oszC/btf6v5VALz8g068+KXl1wMuai78cTBc/wmu6P1rawr/yuPA8zK0KwEG2j7+gCni/Js3IP1vxG77wP448eNhrvoNjKD8aFVC8rH5uv/YHPD8tEkQ+JyurP+e6gr2jnBU/gY0FQFKrKD4Fmd6+"],"bias":["cW9GPiatLj+BGqQ+"]},"conv_layer2":{"weights":["FKCRPYA6XDts+sW9SX6QPu4flb6i/jU+AIvUvIDxqDygcNq9NNCNvfTBmb0A/qA8A8eevt4mjb6Ayjm9KLNdvSbCdb6mDVa+VtQSvhC8l75r0ZG+9t94vmtSpb4Y5Xw9wGkhvpQi5j1oGH29Zhi5Pobd3T42VCc/WbB0P+qqVb8DMUS/tRAOwGgrgL/4Qyg//8LFPsGmrL6JmkI/P5Mbv5eY/j4C1wg/xGIvQAhBkz3EDnS+L+pKQNf6sj//uHy8POxQQMywNz+CKo09HQQ1Ptpbv7+cdaw/NVDIP8bSHL6gipY/LVoKP8LNGz+Yirc/YdhBQDvQQkBYy3M+BfGevyhtyL9g2my/AqHYv3fuu748NOc+aS/fPrSCez/vMrU+GlkQwFWIrr+t0gG+fA+Rv06E7L9xizS9AVeKQM3saj7bkQu/"],"bias":["AAAAABYhwT5TnqI+"]},"dense_layer_1":{"weights":["gEeaO3jZyD4ol1g+ZBvfvn3iLb9qITA/Aw0IP6Vppb95PZw/ZSXWvhOruD+mzDq/vmJdPxlHB0DWE+u/GHiRvb87JL1UkzG/"],"bias":["u2eMv+TJQD0mNw+9AAAAANdFFjsAAAAA"]},"dense_layer_2":{"weights":["2eNnPz1lF0BKtfu/lws7wIXN5T1aFqq/g+DavfenlD5C5Yo/VEjWPp0gZL4ZQjzBBQkWwf/tAsBtDGrA0yzWP56d8D5GTN8+6MfAPQc4Fz8nnDQ/CFegvWCzlbx+3ie/HnvcPu1Uvb9Wsuw99WPQvc6eN78vtwQ/RO4wv4BYRj4ydpg+3hCmPqigor4W1QS/"],"bias":["Ih0pPTjSTT7iJME/0dW7P0eSoz8jj8Y+"]},"output":{"weights":["rU0LQA8Wyj+IJ9i/43fnvlp3IMCX+fg/dIwcQOAV9L8rWv07R+Y+wMkpBkD95ANAyKpBvqTlszyCfbg/JB22QBbZNzt8bZa/"],"bias":["qux/PmwUmL3XEt+9"]}},"hash":"f812eb9a99b38d77900b6e7c2220e1a614f7942b42ddd35070b98ba033399801"}