{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-CNN_detector_withSelectClassDebugged_1000epochs_small3_CMS","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,7,7,1],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7,7,1]},"name":"conv_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7,7,1],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5,5,3]},"name":"conv_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5,5,3],"dtype":"float32","keras_history":["conv_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3,3,3]},"name":"conv_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3,3,3],"dtype":"float32","keras_history":["conv_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Flatten","config":{"name":"flatten","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,1,1,3]},"name":"flatten","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,1,1,3],"dtype":"float32","keras_history":["conv_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":3,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3]},"name":"dense_layer_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3],"dtype":"float32","keras_history":["flatten",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3],"dtype":"float32","keras_history":["dense_layer_1",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[7,7,1]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[7,7,1],"values":["xnMFvhoAJ78RW5g/ZD5wv+3+aj/I50u/YpZPvbZ2DD8+a3C/gQ2cv/SXH7+jhsG/nYfhvZOCf76t9DY/EsTXv+7A1L6FF5E+jr92vgovCj+oBsS/MGyWv4Ksir7ozR6/47AxwAuqm70tEIS90L8cwAHCYb+0ukC9TX8gv+dqlLz5bXi/Zq8mvxCVPr/F+XW/H+Kqv1IKdb7Sqwy/aki+vi2aRb2G+dI//OrtPnccoL14fIu/UZvAvYeho75bnSW/etLVvw=="]}],"outputs":[{"shape":[1],"values":["AACAPw=="]}]}],"trainable_params":{"conv_layer0":{"weights":["aMYiPw8J8L4lwiJAHMjqPhsnaL10o9E+ZL8/QKiwIkDD8p4/h4AUvxUzb74TfQ27xkJbQCoTib5aOlC+/GlbQABrFjuCsq4/eDTnvkl+dMGnNiY+qZ2uwOBsr8Cba/A/GGSRPUJILT7+iqA+"],"bias":["wtSWvMNfzz1T5Q8+"]},"conv_layer1":{"weights":["PIzvvmaSaj/7B8++sQtZPDenDT/qbdQ+kNnhvzf7lsCOaVk/GXeWvwSiSr9PCrq/6gTRvuOgGL6LZQdA7ao+PgYYUj94zKnA2TDEv0X11b6YPtO+3llkP2MMmj/va1i9JMiIvpUiSD82YmA/lDlcP5YDvT/2FDU/9wWVv/Y3fT4boFxAIx9Nv+59Cr4HBLI/x5SQv0ErWz/BbAFADrghwHOVhz88R3O/8rXePsECYz+0GxRA92tlP/+m6j/L40W/zXQjP8yPqz8w+F+/CDH9v4a6yb0EcKE+cqIcv3txqD501ta+0gocv+sHAr0YsKo+Xd7nv6AeTT7DcBVANOkLP+n3vT+fK8+/fmOtvrivuz9sNWW8kNuLPm7UPj8qAZq/2bb0P8V1XEA8K70/cxwpP8C4Kz9ucHi8qWEEvwSkCEBPQgLA"],"bias":["7NEdvjcoSD+uz7w+"]},"conv_layer2":{"weights":["umG5P/GivD90txc+SGxzwOqPCL39JEs+lDeSP28iFj+cc7g+Gz+0PxFm675eHzg/zvaQPn5tqL77hWm/QSTGPw1urL83LuK/+Y8VP8bjqL/3jHo/QH5uvSyhj7+fAsQ+hFeQP5t0BkCC8H+/ifVvwEZ80b/HYb4/xYuKP+eZTD8XsF09gstTQFMTtL55BQM/gVD6vzxvzb7oSO0/c8pfvgCejD7PCCM+1CjwwLD8Tr+KU7e9KIxtQH6s+T8i5+u/QLFdvUjsFr/Sj7i9eq+LPxWKwr4AOybAqX9aQACmzL2quKS/Ps2PQIHNvr4xjsk9Q1rMP5/FXb80wpM+mLZVP5dAab+6kRm/xHSjvt2fvz0oUYQ9epmeQJJRdD8DV2+/i7U+PpV88L5+BHfALAblPa8Iyj4A9uK9gg6Av4xTL0D/nA1A"],"bias":["3HrzPx3G7L+bctk/"]},"dense_layer_1":{"weights":["u6UnwA3Ivz3oYwE/Kig1PW44g7+QK00/IbEBQLUy474IkCA/"],"bias":["ol1QPk4OY79kjxVA"]},"output":{"weights":["xq7hPwFrkz4o0NG/"],"bias":["QUe3Pw=="]}},"hash":"517998351695e633a3c25e86e4c69c207dd5d05c13741b6e93f88041cc15ee52"}