{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-CNN_detector_v9p1p4_tfv2p17p1_kerasv3p10p0_1500epochs_small3_CMS","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,7,7,1],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7,7,1]},"name":"conv_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7,7,1],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5,5,3]},"name":"conv_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5,5,3],"dtype":"float32","keras_history":["conv_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3,3,3]},"name":"conv_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3,3,3],"dtype":"float32","keras_history":["conv_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Flatten","config":{"name":"flatten","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,1,1,3]},"name":"flatten","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,1,1,3],"dtype":"float32","keras_history":["conv_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":6,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3]},"name":"dense_layer_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3],"dtype":"float32","keras_history":["flatten",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":6,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,6]},"name":"dense_layer_2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,6],"dtype":"float32","keras_history":["dense_layer_1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,6]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,6],"dtype":"float32","keras_history":["dense_layer_2",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[7,7,1]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[7,7,1],"values":["8UhYvpI6O73DkgFAmHjbvgWDDL4SrTm9ofUHQE4cCb9LoKC/A97jP+pNrD8tXNu9dr0sP3pDgr560tg+CmaavyFUFD6sbqi/kJa0v9zzL7+xJIE/MAAaPz9Zgr5cKz0/XB+mvwP6ij9xDLc+7feqviMwXjyP2Mq+pT6wP6LaCL8aGC8/FMo3v+VUSz5o2iS+OQS4Pw5tlD/65pa+1KOEP0RUs73gqqM/Yps0P8WYG0DIlPg/Vx5nPwzTrL8MMKs/OZodPQ=="]}],"outputs":[{"shape":[3],"values":["GuEsOOm1yz2QhmY/"]}]}],"trainable_params":{"conv_layer0":{"weights":["ISa5vdK2djvDmk68hlOGPicd6j2ctrg/X0CbP+a/Sz8s2bs/59tNO3vgBL6jUhk+0X5JwY9pjb/AOibBdl7SvZCC/r2xGf8+UVuoviJCtz9IDyK9gFu6PuVuYL6NNNs+QIBWPzWrAT9hPHO/"],"bias":["u9AROiOIdD79HF49"]},"conv_layer1":{"weights":["U6g3P4f5B0CxdrY+IwhYO4GRCcA/4tk+8hOYveQPJb4VsB0/A4zUPiFvIL66pA4+G1AMP2ckl79bARW/HxKUP+tNLb7pylk/3oHhv7a8xL34S6W+7mKZPG59hj5fm4C/Z03Dv9SnBD+N3KS+jkxdPziOAMAF2/g/X7EEPzK0Lj9lotA+uQRVPh2vpb8bQ0S+xjgnvj5Se78QbP4+vp+UvjNQDMCI1DI/nGnxvmKT2b4lP0m/7+Z7P2QNwz92Zai/TlZKPpc6fT8aAfq+xvjwPh32ez243GE/+GPSPp1pk79P0NO+xPdfvsEpfL6QqB2/pFuqvicxur+3W8O+1Y+9vtxhV7+7Hkk+c4OJPh23AcD8zES/x4Q+PjPizb/kb8w+BAg4Px3GE78x2zW/yVjsPh2Hyz+vS52+CH9UP6DhNT/J17++"],"bias":["01TKvX5QRz/xQZw/"]},"conv_layer2":{"weights":["V4AUPwlxer+qMTe9yIOwPv+NA8BeX88/vpLPPrgISj/rSPS/5KJfv7vYSL9aYMg/I9pPvsPj8b2+sh0/J2y1vXsr9D4lgzQ/5JCFv4JnLD8qS6o+fnGRPUACP77USfO+zTZHPuWo5j77hsk/qc2qP4ZEHz/xCYo9XrOHP8MiWL8+KAs/KRUsPiaTn78zTiw/Zgxlvwp2UDwNzmG/yEudvLb3ubwKLHU/yTOhP2/yVD022Cm9xqCMPmYtnz/1smi/bxB9v3nJRT67eJi+Qu4VQCe5aL5iOaw9aCKBvmZROr6nqtc7ko2YvqvdNb0o8aS+UPe8vNEuuT2OkZa+JhWKvtQvHT4fXFU+7ANbPifAr767gkq+CjYPPbbuCr7cIuY63kyUvn8wVL57DbC+oTo7PLbUGr73wya+dr5ivpM6mb0LISk+"],"bias":["LsAfP+cxlL5/U7C9"]},"dense_layer_1":{"weights":["aNWHP3M+Kb+kqY0/HhzRPyI/SD8n8xq/AeoTv04pGL8i77a+cD1Svs+0sT8gA7G889PeviSuEj8MD4C+FwZzvdQ4Q71AKAu+"],"bias":["UKyOPwAAAACN8SU/+Pbnv9/12L4AAAAA"]},"dense_layer_2":{"weights":["D1AAvzJYPD+NUOE+d8dZPzKMhD/C27a+79odP4g9XT5ABeW+kG0WvR6w5D7wJDI+mUKYvsryJT/jlEO9l6hkP3+YsD8gvly/7CIJPhUgJj+ISvc+fv7hP87W4T4JUJA/jzLOvpMGK7+ZWwjAo6IDPw4WUb+nslg/VYwyP0DMabxAPmi8SJ7qPcFbK7+ge8q9"],"bias":["AAAAAOwMB78zb6Y/SziXv/T0Sz88hB2+"]},"output":{"weights":["B0n/vuByCT74kuU+lxVevwyPAT9t/6U+RV2EwPRZnj+OswPA/mjeP/9QAr/8DZW/N5r/v08QDj+hjfQ+BJeJv4p2ab+nQ84/"],"bias":["3FS3v72Adb+4lM4/"]}},"hash":"8f7b2cfefa9f4fbaedc0487baf8f7a4df173a2c7913e6480f09c3f2797a10919"}