{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-CNN_detector_testArchesDualClass_1000epochs_archsmall3_CMS","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,7,7,1],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7,7,1]},"name":"conv_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7,7,1],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5,5,3]},"name":"conv_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5,5,3],"dtype":"float32","keras_history":["conv_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3,3,3]},"name":"conv_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3,3,3],"dtype":"float32","keras_history":["conv_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Flatten","config":{"name":"flatten","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,1,1,3]},"name":"flatten","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,1,1,3],"dtype":"float32","keras_history":["conv_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":3,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3]},"name":"dense_layer_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3],"dtype":"float32","keras_history":["flatten",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3],"dtype":"float32","keras_history":["dense_layer_1",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[7,7,1]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[7,7,1],"values":["xDHbv6613j802Bc/7JgPQMJ5WD+nvNO/mmYpv35h4L95Erq/v5GCP7R/7b8QBG6++J77vlWmvb4KRQ6/QLQBviw3tT+j6IC+9w1kv67cuL7mmoG+l9DWv5WSFD7gPqU/M9WVvpmpMcBTA3M+3uuhv35UNr8KHsW/Zpikv+Ym9z7VAUG/F4Tnv3x2C0A7dKs+x9HfvmJxZD4HOMM/clUbv8lGuD/mpXg9/5mSP1F9yD2Vgbm/3w1BPzuXtT/0rLG/ZazYPw=="]}],"outputs":[{"shape":[1],"values":["kpMbLg=="]}]}],"trainable_params":{"conv_layer0":{"weights":["lW/KPB+cEb+fWyI+UgwLQDlfwz76CRu+RIIcPnLYhD6p96C/zAxsv9cQDL/WJO6+NaKuv7xKMz63zO++UTUbQOM+Or3OrVtAdz3oPGOPVT6JvZE9InvbPpxpeb4F404/TFluQBXLdb+zNuZA"],"bias":["9smvPkyT1j6PvAm9"]},"conv_layer1":{"weights":["fi2OP+Ps3z+cYgPA3EhCv/aD8j/lL4i/XpbRPtkaFD9ivmc/25Gpv1hsRr2Hsl89C80Qvs1cJz9C2X++IuSlPYFao78c99Y/72hFv66lUj+b18A/23AjviR6Uz9JMTo/tFPFvgrgob+vjVFACtaHP6Y/lr/zRWs/swexvYdZh7/QlDM/MZ06P+ERQ7/u72E/vHabvqIRwb4Zxnu+iBM3P3wWuj8wm9s8tZo5v5qCtj51ww6/XZ69v0sjrD9+Geg/+LpHP1e/277asFI/V13EPYASEsDGoo8/K8BtPwJMtz0wn4DArfCfvrvGRjpfEaC+33u2P2z7wj+HvQk+wqQAwFjpnT65fZa+mIjGvyeKZb/jPaI+dCewvpX5ab/zyIM/gOOiP0vj3j+uljW/AJW/vVrdlb9JeZ4+LCAkvw0AHL64ncY+"],"bias":["LtuOP32aM76tK+0+"]},"conv_layer2":{"weights":["lrM8vnA6c74owEK9ZtaCvta4j74oYwk9FAzJPRq9RD6MR/29M1WFvqgJQj3xWZA+Sx4EvoIkeD6j1pY+sNlNvqZALD6AphA7VgPPvRrHBj4AsKi9LYydPmA3h73Qjsm8C3eOvrYmbT670Ke+62QqP1/RBT/3hba+tmRnvm20cT+CG/k+3iSqv92LkT7bu4LAzyqyO0hGx71HARY/EDrWvnIQpz/NIJS+qTCPv4DscryTZ4dAQ/exP8uXzL9G5dQ/Iu0uP7fXS78f3MA+VBEvPt6lt79Z/iHAYCxaP4/Gi74E+ja+InnTPgGkyb8Uzso/ax/nP6qD4b5gu6Y/108ev+LXKT9EFsm/IhBxvn1DvD1Hza++2p3Jvn+Rpj/HTgXAaZ8LwGgBvj4wn0Q/7I0RvzWS4r+7WofAHWupPlav3D+l/bc+"],"bias":["AAAAAGd2575E6BBA"]},"dense_layer_1":{"weights":["QOxnPYzcT79sslU//iqfP6igOb9TF5w86X3bvgy8Vr+UVl8/"],"bias":["7R5tPwAAAADLNMk/"]},"output":{"weights":["n4ssQNQ89D4VavS/"],"bias":["N1OUPg=="]}},"hash":"a3f1babec27da2cab3021417593cd33fff06111d1a7dedc6fd2bef4cca6d577a"}