{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-DNN_photonID_balancingClasses_4kEGammaChunks_newPreprocessing_test_isoShape_1200epochs_large8","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,10],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"dense_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer3","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer3","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer4","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer4","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer3",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer4",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[10]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[10],"values":["1oXHv2AMp7/8ww0/EHSJv3ByfD9gNJM/vMpkvL3JKL88UfE/49mqPw=="]}],"outputs":[{"shape":[1],"values":["AAAAAA=="]}]}],"trainable_params":{"dense_layer0":{"weights":["I4aFP8flJr/Ugro+q7E2wNIibT7Qm5U6GcE0PV/Oar/edz7BhccGwVlX3j+Va+DBU6COwFuWV7+7LmS9XR1iwOaRSz8Mqx6+PySEPiKzXz2BvJY+5RICvpRPEL4qy4A+VxG6wChQFUGScOq/atKyQaurgD1WkN0++pGNPqibxUBtO1S/r3BGQQX9db5O7idA5T2KP6tfPD2STM8+1UvDP50uLUHK+kA//f8MQAzJ2T9Sny6/8rm6QQ87N7/03pc/xjezwoJolUKPNI3B1lqBQlcsfkF/w4dDGDVRRNP4o0PGFuNChj6qwvb5zEL2Co3CNscuQxn9nsPGSaJBdCXYw9NLb8Fc3TJAg5YixNYnXj9IoqrCg3ZsP+Ltnz/ZbAZA9eLlwEJaij80aww+Qo2kv7VILUCtALi/l9QJPofLwME="],"bias":["+Ql0PrilZr4hp8u9kj5dPtXjMj4CDMM97fhTPbL/gj4="]},"dense_layer1":{"weights":["pXKyP45Ar7/LFeO8Frasv3W0UzuWkiZAjAUZv/NcpD7uDTg+EbvFvdw2Rr/NIdg/0PoqvrXkDD+T7t29LXGHwMI9Rr459oPAMDJfwB64+L6bZGHCZyw4wfXul7+PwA/AyP8/wNv9BsBtkTbBEyVUQGurF72M153AGc+rPla10kDe/4hADOcnQHELgz5Qpci9PHMhvfPX8T/JQa6/jOKav9SPEj+rWfo/Gd02P+ImLj9+4XJAVajBP3CIC0CTYhk/DzzlPgIEyj5FY3K+A+Gmwe1v776b8Nc+xjvKQKPNKkBRpui/p+2SwLQhUD5izV7AccLMP6XOAcAW7TY+HDgGwA=="],"bias":["5/CSv+vf0j/rBgBADrXQP1syYz/FusA+l/TjPm3jGEA="]},"dense_layer2":{"weights":["UVSAP+6gOr26fkbApsrkv4+c3rrPk3S/2ox+PxoIUj/xK6i/SYKrv3pOerwFjhM/5JulPxJtEr54CGy/cSW/P42m0b+AIsc/F4FZPufgKD+8EZA/sT3QPyJYCUBz9ES/udzOPxpNYD9qD2M/WNJ6P8+Esj/YeMk/5gqaP4+JST+0fbu+qqgIwPJkT8AaX2RA+ODSvrzC7j7r1wa/lrSQQGlBWT/Ath9AHqlLQI23dz9z7TJAxMonv0+CoL7fh4S+5JSWPofQ0L6kuK0/k+5Pvsxf2D/0vsHADi3nvvsRUb3vq/q/X7HCP9UxdT6nGB0/jiBKP6R4zr46kS1A1K6mPg=="],"bias":["1oEXQHMvLz9cLe8/pTADwbdc/79dPIJAwLoMP73vUMA="]},"dense_layer3":{"weights":["sZ0nv+tDez+dhLk/NstQv9scPkDOg9w/dAYBvhUqqT0WJwXAZTeDP0ktuD/hIYA/jnGbvz5bUz+EQ5G+DmyDO5rBoD/Yx6K/NL0WP9pkx72/Dqc+q6KLv6uLTT7oclY/GWU1PrsyEUBqwdc/a/1DwPmuZz9CsQO/VZkZv55yOL9NpYI90PXZParo2b8kfce+108LvwMdCr/30zS/07v2vzvPmMHyBZU/xaTZP1bFlb8otLC9NaMGP/Wm2j3Kc8u/uR+CvX06Sz+3BPk/Z4PJv78OK0CxBYc/PtwWv3bU4bxmcOE+qjr8v9mX4b7q1zFAXhaVPfxMKj/0/kk9oc81Pw=="],"bias":["hRe0wBG6/kD8HoLAZqcTvzuQK8H1ayTBA3AHv2z2vEA="]},"dense_layer4":{"weights":["RtM4v2FC0T4e++a9nZcWwIHVgb5Vicu+LRikPQRNqb6AI5I+uHBjwPpqHz+MM5e/oCtrvi9zCb82Z7g+sKAjP86u/cDa7SdA3+L7Pgdq+r7bBVM+haL9Pl/hNb8RTZ2/XO2mProGkb+M+3u+SlXTvruCqT6YXEC/rTikPqs5j7/PhSG/2nZKv6kmwD3f2hDAxbAVvyct6z6/Xcu9KbyMvyDDqcBd4WbAR33uP51TxL7WEgE/u2u2PsnDEEAWCopAPTdnPc89kz1bl5G+CctZPggUkb6BD7W+kMn6PqcJkr5UDTC/hBMkQNK2Zb6rlSrA91YwPwTXIb/Nv/o+d32qPw=="],"bias":["a4ahvwT5VMBawJ1AM9cGul3p1r4KoKtA/5DGwEPOCsA="]},"output":{"weights":["Jvy9Pdl1gT12IoC+/IHwPV54Hz7VuJ+9Ccx8PRt/Ab4="],"bias":["qqfkPw=="]}},"hash":"671c8c218a7d734cc373f36541c3120834f68b5c814a5717d2ce6beca40dbd34"}