{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-DNN_photonID_MINIJetHT18RunB_MINIEGamma18RunC_barrelOnly_fullDatasets_isoShape_1500epochs_MINI_med8","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,10],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Normalization","config":{"name":"normalization_layer","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":[-1],"invert":false,"mean":[0.02098510348266935,0.03128491911187126,-3.3509383852235174e-05,0.03700180043401429,0.013574535178612053,0.11866452092902222,0.2696403068222918,0.21651482286376225,0.00018123518689383168,0.1508019106092143],"variance":[0.00012172718537405411,0.0004265444327636827,2.5058744406018974e-06,0.00037292830597107553,4.106280350733436e-05,0.040020248485129674,1.2063652477557605,0.9750772415861664,9.970613980422724e-08,0.050887194657617214]},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"normalization_layer","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"dense_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["normalization_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer2",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[10]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[10],"values":["wO7ZvURpEj9iLYc+4piGPu/9hr+LOaS+/qWcPl1K4j3EpBK+gma4vg=="]}],"outputs":[{"shape":[1],"values":["AAAAAA=="]}]}],"trainable_params":{"normalization_layer":{"mean":["9OirPJ4kAD1tjAy4M48XPbpnXjxiBvM9Sw6KPhC2XT7zCT450WsaPg=="],"variance":["yUf/ONOh3zmYKig2l4XDOdk6LDhG7CM9LWqaP6meeT8IHtYzF29QPQ=="]},"dense_layer0":{"weights":["/jfHPr6/9DwtaUXAqrGHvhmCGEBA35S/wg3evukOPLx0n18/odyRPa5hBcFWV4e/l8WhQOi2LcBJ8Wa+ewEnvXS2l7qpS9W8izUdvqsK97yFVe69+QAPvV/uEL4JzNA6+pAxvwIOqb31jsBA9rIlP6m3ocBz0BFALNRmPw+iHT2b9WS+Ya5CvKgFI0C/ea8+E86rwGfPMz+0l4U+lGwbPUOeFT/RhEO9k0oBPlF1x72jEtm+p1t9v4KAL8EbMuY9JBJQQJSdl8Ffb5w9nesTv72p5T80UfK/ATLyP2AzID6eCLtAxIWIQVF4g754fIM+JI1ZvU/PDEFkMXs/j79nPm04nz6QjBA8KEGHPs12SMDYqnK+yid0vs8ORD9+HUXBiJlZP9co8LwDz7K+FbuZvRno1r4s7ELAN6P6P1EziD0="],"bias":["d/lDQFsbOb9R5GK/thuTPxEM4j9ySwFAzbQywGT72cA="]},"dense_layer1":{"weights":["s/abwFG0SkCCJHK+SX7MwBSFFcBCJVE/B/ftPW2Nv70SCMLAlBKqQPkQVMBxvTBAThdovqAajjx1dVxBeNduwamWO7+iI1W+zlXSP0viRL/rY9m+VToTvzImpD+Su1zAzJeHv/kakUAG7QG/Q8i9Pol8tD99wSE+doFEQB1zwT4vRVM+fLyqPrCR6j/hWQG+2CdpPWL6hL3DCio//nY6vxdLdUDvAw3ABVP1vujgwr8rLLw9W2IvP1bwAT+9RElACY+Xv2lMsj+YFg6+m2I9Pm+EXz/EWt4+8sRPP2im9r7h4HlAHEcjQUzMoUAPiTW/7uhRQoAzs8CgFw7BXQqrwQ=="],"bias":["c2I2v/XVGsENsTDAgaEVQfHDLMDrhiPALnu8v9RhpUA="]},"dense_layer2":{"weights":["WRQEP3BQUb6vNBG/VS2Ivy3J6T2Q8VFAnNLePVD+n78bo/m+IbYdwOAmAr+8nw+/L3mXvjPUsj3kTXs/1Ms2v0QBGL7owA0/mR0Nvr4Sgz/YIKU/rrYhv+ipJ7+Oo64+E2zpPnbCjUD0uHW+GTTPP45jFr/Y2LK/ySX3PqLLtD29EXHCsg+TPotrB7/i7O0+kgfjOwIDXj5wwlXAq1b6Phx9AEB954TAzgbrviEwQD9uoHM+8YMfvrMOZsASZYK/6ciMvyMOk7+84HA7gfegP0PToj67jqK/1hRIP1/FWb55Kx6/uEOUvzvqhr5tiRO/IHI8vQLowT4PYaY/s+0LPw=="],"bias":["UJReQUECAUHOj4++4aRPwKQ0BMHo7ZNAX/zuwJiKmT8="]},"output":{"weights":["RTLhPT5TGb4l0xE/X4wwvu9vh74NIcY9wSdLPsfu1j0="],"bias":["OCxXvg=="]}},"hash":"c954bd8be91b3ab5cbc0d7d54e7598fef6a4147de9419872a74de8b117f8f1bc"}