{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-DNN_photonID_MINIJetHT18RunB_MINIEGamma18RunC_barrelOnly_fullDatasets_isoShape_1500epochs_MINI_16-8-4","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,10],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Normalization","config":{"name":"normalization_layer","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":[-1],"invert":false,"mean":[0.02098510348266935,0.03128491911187126,-3.3509383852235174e-05,0.03700180043401429,0.013574535178612053,0.11866452092902222,0.2696403068222918,0.21651482286376225,0.00018123518689383168,0.1508019106092143],"variance":[0.00012172718537405411,0.0004265444327636827,2.5058744406018974e-06,0.00037292830597107553,4.106280350733436e-05,0.040020248485129674,1.2063652477557605,0.9750772415861664,9.970613980422724e-08,0.050887194657617214]},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"normalization_layer","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"dense_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["normalization_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"dense_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,16],"dtype":"float32","keras_history":["dense_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,4]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,4],"dtype":"float32","keras_history":["dense_layer2",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[10]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[10],"values":["slFKvnibmT6K5Lo/09q0vuzy47+2O4G/bZamPxOxAj/o308+DE4NPw=="]}],"outputs":[{"shape":[1],"values":["AAAAAA=="]}]}],"trainable_params":{"normalization_layer":{"mean":["9OirPJ4kAD1tjAy4M48XPbpnXjxiBvM9Sw6KPhC2XT7zCT450WsaPg=="],"variance":["yUf/ONOh3zmYKig2l4XDOdk6LDhG7CM9LWqaP6meeT8IHtYzF29QPQ=="]},"dense_layer0":{"weights":["y6ObPjAOOMAYH2hAMXqcvbX2nz8TK4M9yUYHwIT1VT+BCFU9syU5v1F2Ob7Ns3s+f6xWP7ACrj2bJdi7EuHWvlhnQz+JSA3BMSXDQNsk9b59uS5AUiMXv6ZRq8CJorE/HurUPRqUAcAfH2I9i+4WP/lDbD/N4lo/aEAsvYPoFj8avSm/qMK9vTz9A75q43K+HVULPiImXzyFGQo+v5LIPZaUQ7yG4OC+qAz9PFq+BT3uky8/sBWXvgLlkrw2kQi+QrkGv7bdu0AJkN7AEi0lPh+9+L+7Oms+C82RQO6Wo7+pdc+9GsW8P9xH0D1Kydu+Q6SQvymiEb6QqSo9Tve3vCxTS74sgRxAuYotwF7p6D2Z0sC94+XtPnEjUkDZxfa+81UZvIN6oj4cs9W9nk7cPoIL1L42XPG8AC0BPVcuusDOQCi/HpFjPRoCLD/jDoy/eblqP2iXm75r2GE+++y/vwvlpbxCqZK/rMwVwHRmXzzVULE/K25YwbEKHT12aIO+S32pQGi96j36v5ZA6oW1v2He6EBU88g/V7CCwDQ0UcBR76DBLWHbvkR7iMEEHfG/2U6Wv1cV2j/vjNg9P/+aQHtZecDi95Y9zz24wIUBSMBJoWXA+2Iyv4KwOkCZExXAwPWQQe9e0T8eTxzAnTS0wf1iAEDiQC5Ahp2kvTDFb8DWx7M/JZXIPZxx6r0btYA+5gaAPg1BJsHLZ9M+5yB4Pl7gobxLxGNA9qg9wLsYhT1fvg6/A5srPwDeTcEoFCU/NIuPwBgTOr5jKv+9bXQqwfvQ9D8OJoo+tr2Pvitaq8AHzBg912kfwELdGj2pbFk/u4GxP4Uemz91Hl09dXO6vg=="],"bias":["rGa3v/bJxL+0ue4+4OvJwDJwJkDE73e/9O9NQLLg2r/0Ski/FHyDwLgSs8APGGrAcJM3v+nwjsAyI+fAo4AgwA=="]},"dense_layer1":{"weights":["G78qv4dX478/eSY/SaFkv54IZzvpZ/o+heVUv46pXL/o6rO/Dc+qQJUvJb/tWglAPeafvyADBD7L2R5AKPCBPaEJ4L4A378/yNAKv6yvCECejqa/XEJkPlOusb7H1js+SpwjQMGHcj8YsPw+iqn7v7DZKr8chYPAr3m5vzqZqkBZGyC/CKJTwLJ3BT8NY+e/SU9mv7otPb52h8a+jv/FPmoUnD9xemG/U/avv1Z3OD/ilFq/rwYeQB06xb70u/a+ai5sPiz2E8AeNva8H+k9Pz0dXD4/EKC+mZo3wDWSqL45OBc/4aDlPrMV3T0cQ22+FdC6P3MPV78SDiq96qsewLrzNMBqaTRBPQXywPRZPUHY3J3BR8etQGCcKkAT361Agf72vwmLQT89cRy/7wCmPpAkdr/I61u/1XgZv6vgPj+eoJO//xqFP5ULAz8zXiFAFA/+v6LA6b4PeNC+D+gCvvpH3bv8G2JB+bX4Pa2ZNT8AZJ2/upcEvnnFyj9U7S4/7oVGP2I76MB7+Bc/qxWCv4ZOQT8Pepi9V+QEvvxLib9S+gDAj/8Yv2j9B7++l04/0di3v3GjWr2TNJg97e7SvYrVAsNmmotBmGcKQBDAZkAk/TTAJVg7w4sbtkDKbSJBNadxvpPaJkC3yOy+RqGCPxinnr6OSMu+HhxovVlRqb4="],"bias":["cR2vP+L04sDcKqxA0NnWO1IPIUHESzM/4Do0QbglRkA="]},"dense_layer2":{"weights":["Yw2DP1GFOj/EDgQ+zIDiPgJTIL8AvPe+AhIlPvIC1sI3rwm9TbsDPr2gur4Yixi/r2ELP72DoT2e3Eo/e4FRvx+qtT+mphc/FzdRvhLWxD5ahqi/FYgNPyhsML8mgU8+Qy+AvniHzb6FZ6M+RXcBPpmGRz+u6B2/guTivqMxxj4="],"bias":["jSIPwdxEGED4e59AfC7ZPw=="]},"output":{"weights":["RXEJPoD7Oz5CpZO+fRWwvQ=="],"bias":["5j6NPw=="]}},"hash":"ae1a26bc916c13b6b927069c349f0ce034a24b02549f1e18cdf13b4de9b42834"}