{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-DNN_photonID_JetHT18RunBC700chunks_EGamma18RunC_SMSGlGl_StandardNorm_isoShape_1000epochs_large8_endcapOnly","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,10],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Normalization","config":{"name":"normalization_layer","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":[-1],"invert":false,"mean":[0.02706677967479936,0.03795658708975834,-9.17257931900065e-06,0.04122946521028658,0.02288269494774995,0.1313982684951668,0.2817787027204204,0.183947011681458,0.0006461354358073151,0.05958178810389314],"variance":[0.00014080716094500083,0.0004915367698791236,2.3524642030850356e-05,0.0004780956523920267,0.00010407481430062477,0.031114751208379147,271.91736287073144,47.7723928811009,1.1291217754804051e-06,0.018765447994738345]},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"normalization_layer","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"dense_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["normalization_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer3","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer3","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer4","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer4","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer3",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer4",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[10]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[10],"values":["VOzrPtW0Cz95z90/yM0UQG3Fn784N04/0tl4voZN8b7f23m/8Xd+vw=="]}],"outputs":[{"shape":[1],"values":["AAAAAA=="]}]}],"trainable_params":{"normalization_layer":{"mean":["J7vdPF54Gz3u4xm3OuAoPX10uzxFjQY+TEWQPptcPD5qYSk6CAx0PQ=="],"variance":["oqUTOXnaADrJVsU36qj6Ob5C2jhd5P48bPWHQ+4WP0JUjJc1/7mZPA=="]},"dense_layer0":{"weights":["951GPYXwXL/XULO+f6Mpv7Gw+D4eY8S+okmHPHK7BLxymxU9d0Hbv9egB79uRpM+woHvvnlfTr9qHjg+uo2Uu6A5P7x7hiu+zo2DvjUFpr7mwuY+G0BFvizPdL4rWTs8WxSRvQ+FBUAfoTs/8e0APwDX777D1TA/LHOPPlS9KjxTPPU8ms2FP7iq4z4yvgU9CTJ8v7rE8D6UnGM+VXZfvOmiXLyb3Z89Kxs3wHhfBb5d33s+GDtKvzSkpj7T1hu9haYfwmdgRcGtLgDBKvBlwaUcAMJJeQBBrBlWwQbjoz+uu7pAbQW2QMhOVUDIQedAnc0TQSue77/ZqTxAejSavpKglr09bQM+MkwOv6C8RT5TCxm/Cx9WPkYhPL4E7NTA3QQ+PS/X2D6PBSk/Hg0TvDOR6D4kbrG+xelRwCH/Crw="],"bias":["ryCxvh3j7j6a+2u/wI3EPppQUb81ags/ADKPPHZB1b8="]},"dense_layer1":{"weights":["mzKBPS2RKkHThzzA8NEkQCEZgkCfacC+9vagP9aZicCCknw5aSUevxBvwz+0fJs/eRmWP/in2z2anjE/nicKQJ7zmb1KKaw+WVSYPmkngT5TYTq/s5kCPdHijD+8FTQ+xgNnvyzWbD9HXq6/Y64sv5awi79nXa29QGRkP4LOh77zOSc/TsCSPySz0r9SdqE+xlQYP0kKXL3sk7g/Ts3Lvmk7RcCLTuO/+zgWPrN+Ez8iqwVA/KjuvVEiDL/JUQI/LHjGPlnY4LxB4hm+fMu/v0arnj9KOG09z8OmPl8MCj+/zek+R2n9PM0DdT6A3ve9XrDbvqvw6z/ewr0/wxpzvw=="],"bias":["QL0kQPGMOD1MRkg+tXfOP1bei7xpYojAJJErvzemL0A="]},"dense_layer2":{"weights":["a/yIPhnhBr+QNS094t6DP+FjsL8M9gE+cLiUP4RSmr/xCSu9Cxg3PaTKzL7y+Q1AsiUIQPsDOr9s2mW+HWzJv+iOmz1MtPU/SquMPkgeSD/LTbw/vekNP2D8fD+SESe/PYCgv8DSKr+y1UK+ofQPwL2fAD/GEZ0/TMnEP9rsPL+eWgW/HhUXP2uuDr+SCNM/m8OEPsyWo7+vkag/SRrUPqNMosFI35LAezIKvxwih8K+P7tBbziqwVn2gsF+dznBMItXP8YRjT9tBAS/GyWlv44EsT+1y0E860vwvThgH740Udo/ckm3v+hyEL8MReK+mTP0vg8aaT5Wcxu9c3akPw=="],"bias":["oveNvgA4NEAAAAAAR3mrvUW8Lb/0B32/q/38wOnhTUA="]},"dense_layer3":{"weights":["He9zviT8xz40Hlm/D9HePkB2Jr19u2E/M2iHvqROFMBNiAdA+LgYvm6pIkBBn2M/iGS8vQS/Dj+i3yNAJ7s5vnyccD4wPpa9KASgPsG6Cj9A66o91TOwviGfBT9bV5++ySZkv1RxXz5h8Ec/r2uOPzRNub7ymeO+w1OePzBrXz81VuQ8AAgFvyHayr9PK26/IEr1viz77L/fwLm/lw2FPaZwur8Tboe+DTXhPsXlSz/Feou+sTc3whQzVT4vXzM/xVbUvkae7z5T00q+jsecPwHVtL4iZfk/KMaTP3yHYL8yU4C+eQqivuRNzz8bflI/gLV8vDs3c777aEq/65YXPQ=="],"bias":["WXmCP0Tgw0DP2CPA3ZDSPwAAAABkVfXAmMhywJdLvkA="]},"dense_layer4":{"weights":["I1uNvX2XKj+EHorAvCBZv00ArD4vmYu+hbc0PzV9aMHm3Ya+MRxVv9SHfcBMZ6e/3V9MP2ioIT8pK8K/w7Uov8Q2TT7BzGC/6NbHOknEwz/NCqQ+P2buPlqg4D4a5aW/5EUOv8Vzcb42rfG/1xGuPXuJfb8f9oY9do3FvpK6Fb+EObI+AOkYuzXpwb5UPTo+AHsYOzrL5r5f2ws/DBwRPk4FZr3Mq+s7gq5LPuLtAMDrO2LBO+KEvudNV8FZ0Ks/Ztfzvt8yAD9+Bi49qUApv2qAUr1PeWO+Seo9P61YdD51zMA6vbfHP2t+M78EEHI+m07ZPTadIr9xsoG/9o0QwA=="],"bias":["3B8XvjU3O8CTdgk/zMxZwAvxiEBPRD++PnrdPyy0jUA="]},"output":{"weights":["abs3PV0gdr6uuBM/SG/SPWTCVb5zko8+NEcXvjjg1jw="],"bias":["4OxOPg=="]}},"hash":"6f27e748d10b842e79104121e2c2467127640349853516c564dc7e706d3e6bc8"}