{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-DNN_photonID_JetHT18RunBC_EGamma18RunC_shape_1000epochs_large8","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,5],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5]},"name":"dense_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer3","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer3","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer4","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer4","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer3",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer4",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[5]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[5],"values":["XlOsv4j6Qr/GWBU+LXoEvwSy8z4="]}],"outputs":[{"shape":[1],"values":["G7jQPQ=="]}]}],"trainable_params":{"dense_layer0":{"weights":["6pr+vtPEHr9ovRY+vyEQQAucQL/9TLu+8FgMvUv3SL+aVpxAABVSvcSX2UCjuaM/3qzmvvRrOb47EyK/RmipP4+Lmj0gGqs8KS4iP0pKUb6w+yI/VW0Tv2OduL4Wa+g+ibFYPxTaxr5TdGg/71nUP4HYRcCA+Mm8yMPivkI7xD8bViJArGB7vviHlb/Ru9g/fL0qv2ErkL4gBP+9PGQgQA=="],"bias":["cOGpvQAAAAAcTb694dKPvhpXpz4AAAAAAAAAABGREb4="]},"dense_layer1":{"weights":["ARqiv/LhAkDqu4C+1pQTv0meuD91hGo/ARerPe8PRT8oda69glOGviCU6754R7k9E4kNv4gDvT2cqga/z3MYv5Y4GECy7eI/EBW9vbT6Wj6b9Sm+cxyBv1rT7z2ZzmRAVInBvpaajjx/ip6+nG1vvvAYM8CaEI8/Gv2FvSKAhj58cUs/xKJTvsDMKr0aJ2M+k+ssPjgsgr6JOOS9pRXCP0i+hz6U+2u+MDm5vji2kz2uueq+zsdGviFNDD+t3xI/YHwAvZBcaz1UFgE+4gfEPsBOwbx9MQw/xbUXP8CUaT54l3W/Aw1BP2xP0r54qgi/oWQgP7apYz8AkO2+bgfCvg=="],"bias":["jPHhPl7ikb4AAAAAjgghvkELWb7LIaO+bxWxvWprrr4="]},"dense_layer2":{"weights":["70ezv0sNcT9F5/y+QmirPy8or780RIy/IjrHvSqyMD+wfTK/353Vvu2kTr6VoBe+7ewQwK+JPj6G8+4+J/wEwKhFoz5yUvU+5vLAPh73kT6QPWw+t5jpvoBu0Lz0ZL8+3nJLvcimzr6OGwi/KkU1vc5OZr4CPxG9TagMP8gT2b5MshpAuRA5vrKNg77v++u/uUc0P/516D01XBS+9jphP/tQBT8gzBm/e3MAPsHutD9ffMy/GcRDPma/Db/803W+2HaWPnx9RLsEvlq+lsCTvE/eSb6Udy09IcmBvgpFgj4m5xM/HasUP6syJD5EPry/iOR2P4pufD9+QAa/hfqCvw=="],"bias":["JZYDP5YqgT9d6v69L+4MvpQjLj/kQlA+3miBvWZoAD8="]},"dense_layer3":{"weights":["Sp4BPgwUVz8Ag7Y/NxF1PtAisT71SaK/hxwGPgJjLj7tSPu+g9yCP+k6Ir/rIP698BH+PhN2Mr6EmaS+SH+HPkTGVD7VXAE/LeHUvhBObT78aAK/OeSkvoG3FD8awSU+J0bIvidsoz7n1B2+tDVTvnx2Yz99cZnA047CvquGWr9QnQs+cKklPzOlm8AsXRc9zzYaQEoxkD/YmQ5A2gvNPzKGEb/gkQe/jJLBPvjP7r78kSC/tdzoPrwIp76OCBQ/RSwOP5h49rq5L5U+4CifPaGw1D0w6X++klT4PofzLr4Zj3Y+7gFMP29yVzwvKCm+cc0kP8AqM77j0Ny+hQS0vw=="],"bias":["r4cAvCvOmj0KOiM9jDaxvEJNJD2gQ7Q9MKl3P60XRT8="]},"dense_layer4":{"weights":["VN9fvgcB4jzALaM+fFO4PqBV0D4XJp4+yk/YvvwAG74WyyK+KFX4PTfy872B2TjA438yvURcksDaz8m+4fqHPjB3ib55nSO9uXM3P9bQLj/0HjM/D0JYv5aDPz9LKxS/rgfrPgmpfr3Q/Ig+BYe9PvK6uz0OTBC/HMyYPiZb4L6A+ms82BPMvUEIEr5pECE/FLqPvyCoQz7DV2u+TY5QP1uXGD+8XrU97VvPv/ySzb9BCD++mlD6PaLsGj7dqhG/YAQKvRqO7r3plhbA6MbePlX8ir+AQIS/aTMvPzMSVD/rBQW/aIYJvd37q7/po6e+b/u3vuTj2D79ClQ/e7gzPw=="],"bias":["AAAAAL2Fob7dNQo/QgOruyKsur5e+oY9EpTQPv3bSr0="]},"output":{"weights":["4JzIPp0hyLzhliq/Kj43P20mYkBVvI0+++UqP1hNu74="],"bias":["Xmejvg=="]}},"hash":"87c9f27e00cb21ddb2727569f0c9e057dc58ecaac8b9f8e34faad0a705bfe7ff"}