{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-DNN_photonID_MINIJetHT18RunB_MINIEGamma18RunC_barrelOnly_fullDatasets_endcapOnly_isoShape_1000epochs_MINI_large8_endcapOnly","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,10],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Normalization","config":{"name":"normalization_layer","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":[-1],"invert":false,"mean":[0.028350010185985677,0.039820293725858324,-2.9329870845882913e-05,0.043048765499517305,0.024197637707192313,0.13681725931245897,0.29072248166305975,0.20888067687995052,0.0003191764067443302,0.06693996090481794],"variance":[0.00014699417204387265,0.0004669970371576914,1.861562379298528e-05,0.000458915732236307,0.00010573246528341402,0.030545242561300163,709.4690588425598,590.3553652372347,1.5737050022970967e-07,0.01998408782073558]},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"normalization_layer","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"dense_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["normalization_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer3","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer3","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer4","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer4","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer3",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer4",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[10]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[10],"values":["PnlYP7Oskr/49sk/v3VQP92CuL+LARq/bJOsPbFYl778gME/rJRGPg=="]}],"outputs":[{"shape":[1],"values":["AAAAAA=="]}]}],"trainable_params":{"normalization_layer":{"mean":["SD7oPJsaIz1rCfa351MwPSA6xjzTGQw+lNmUPtHkVT4iV6c50ReJPQ=="],"variance":["cyIaOUjX9Dm/KJw3oJrwOa+83TgEOvo8BV4xRL6WE0Ss+Sg0q7WjPA=="]},"dense_layer0":{"weights":["i67gvnBCub4ihTG+NZvkvst9Sz9KeG4/JrPTvvS6xb2z+vC+MpYavrvgE75dzzi/glHBP68MgD/RLDI/0v5GvpDxcDxhJT88qleHvL/apbtKkau9hXAtPdgN8LpGuTQ9wd+HPyF+Qj8QCl4+qyE5P+5u2r9JgLu/nnyuPm7JPT515Eg/0Z/zPqRcAz0VDlQ+eE5Dv/6NqL6m0L++7lFRPguLDz7u7AE91reyvRW3eL7uMMu+35gdviWM4L3+0HLAKUxdQalXSUHpTHLCC5oiQv7Le8CaSiNBtKBXQACcx76kCSjBRj3/wNB7DEGKuS7CAbMMQdxkzcFGZ9y/HYlzP1MVjj4S9xTBnmU+PTwO9j2vPZ0/h9GMPBTN7T1Ju+q+k1LFPl7Eoz5heeK9TIOtvq8JxL6qXTzAGc07PuaIFT4="],"bias":["dg4AQA0ij8Axbk0+/ZvVPjxjlL7yVC+/Nw2dP3pfy78="]},"dense_layer1":{"weights":["jHHkv15stz3pXb6/TFrIPjpekj3zTm0/8CTdvYrNScAk7SZAy2cqvlGdK783u8K+7t27PYdyI7/Nxg2/tZIgvhB8ZT103IfAdXoeQKWIvkDFKo5AQnyNwEfu5T+nTe2+2VX/vHojhkDD5q+/8MbxPnBVgcCVzxNAM/ygwE0NSMCwdpi/CPO1PiJBDD8asNC8h5zUP4QF/T2rb00+R3kfPywXtjv0Jgw92OzsvR56Vj998sU+jjraP2OO/T4dl+k/QMoHv4M5fj/GK0a/mcULP3HD0r6P88w/MJ4hQKT2SkChKhi80IgdPgGUt78UmpO/xWa1v/6O5L9GXoA+/XEyvw=="],"bias":["tLNrwEfDlz+5s4dAFR3EvxIWDD+vMl9AAEASv96a3D8="]},"dense_layer2":{"weights":["uypNQfP0JkH3bvY+YFgkwI8m10BCKBBBf6HBwRiDKT94ASg/nps6vxd1tr9H/zy/ULgNPqzWIMDOx40+cMHYv1/V/b0i8O6/rt2sOkkGicCbUxRAGg3vvTib0L3QtC2/78HAPt6mQD/wZbs/orIPQG3PCr9nHoC/3DhDQCLfTkAIJKW+/wY0P9Hl9b8EF4y/T6Eivx5yDT9eyyC/rRuAP5mcQD6XpyY/rTdZPyjXLEBev0O+psACQPhcKj9WATTAQDoovnKK5L8MMYm/8wMGwK1zTL7ZSdi+YLHAv1Xbdz/MLIe/Z2QcQFGbW76aIqS/1OylP4TaqD6tDY4+NrZlvw=="],"bias":["hPiyv7HaNsBijgdALmT6P0vGY0BGMti/eK8rwdFkSEA="]},"dense_layer3":{"weights":["jBWzP6hkOMAEb4c9o8yfvlD+jcB5xrO/8wtGQF8z+7+Mf0tA7GeBv7dgez9FZQG/06uSP7T/xz5IJII/G+Kev9Tiob9UC/I+mufwPrZYHkDvVS1A0n3kv9D3nT/+usM/D6fUvgfBYz4L2o+/d/xBPsB5u76zP9w+81n5vzDVrL3ChllAB7gNvzXZk78YrgC/0igjPhXYOT/lpqg+Pso+v5BKBD+1tom/20NjvWNcI78ccje/9VqnP6tacr/MlgrAi7IIv8ifir/0xK0/E8sOPI7l7r/TMk2/eGx7v7T/sT7cXzU/HBE1P3DgT0DHUke/RzcoPgi0Bz+LgIu+GYkaPw=="],"bias":["ct8PwO7MB0EZbs7ARWuGQFbO8b0T/fU/tYfcQC4rkL8="]},"dense_layer4":{"weights":["z60LvoI/TL9Fof89u3v7vpvbs73dIWu+igJfvvIMnz6bER2/Iqifv8D/nr9pZ/e/+m87vvdpnr6DpHu/gtvCv4DeMz+x4jS/QDRZPTYhPz977/O+uVnevY2UF766A46/Rpw0PJ2ZzTjVxBy/LXmgvx/7HD70HqM+OJutvToQtD5biiLBrXKrv8DihT8XfmI/2698PFsfPb7lKvs9JQmcPep1P77c1Im/7Se5vjDZBb6CiRK/atS+PgQyB7509yXC2jrswduimr7T/Y+9diuVP8ZzZb6ufV+9PymqPdVAC7+p9+6+pPbDv+8GcT8IvDhAIvcYPro4N74HJ5w+d1EFQA=="],"bias":["VGHPPiTg5L6s17JACykZQXregkDkBQFBdHPJv2ONEcE="]},"output":{"weights":["UOixPSOh077SZ469NDuEva9/+D0UE6I+VqhFPFyQqj0="],"bias":["SsxHwA=="]}},"hash":"fa4d7595f5b54ecc5b48110e73d1c488eba7a41ed72b429fe666dc045e099b25"}