{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-DNN_photonID_testIsoPresel_100JetHTChunks_isoShape_1200epochs_large8_endcapOnly","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,10],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"dense_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer3","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer3","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer4","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer4","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer3",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer4",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[10]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[10],"values":["pGANviSwXj+pfI6/bhjyPWtEfj8AcGm/5m35Pys29D1215c+vXCGPw=="]}],"outputs":[{"shape":[1],"values":["9NPVMw=="]}]}],"trainable_params":{"dense_layer0":{"weights":["xNbHP4/lHcBptJS8ZFPaPW56Sz5b9zfApJnFPkHopr+yohHA1wYdQKJ9D79BRcO+K9GIQJFfbkAobnVACyT8QMN/AD9OqrU9QpYHv6p3gT6jh4i+8uuqvtVYAb/GOjC+aB2Fv/byhT/GqpO8Xy+nvZAwLkBMwS9Aw/90QBdjvUCIrNI//4CtPkEDuT7iD4w+uWPNP7f7lz9AI05AuPBdv4kTacDSh33AlRvivu7oJL9jMtu/q7rrwAAm8z8mX3W+wxcQwYN0CEJHjdm+6/g+w+JKgcKNYaHBSCvDQYL/n0APDfpAyHenQQoFC772BeTBT5DOwb6oCMBA8WzAXNPzQEIYg8HnAD4/kEfrvkJ3hb4GGwRA4SWOwNjJmkDhBpA/3tiWPjSW10CQIQ+/4ma+P6J18cASTXNAjJbTvaw80z4="],"bias":["o8FDPsrwyTxL5Bq+XuICvR46YD017Uc+ZExOvCTDzrw="]},"dense_layer1":{"weights":["DfeAv8xZB0Cjiaw++wJ1PxMBoT6wjAdANCJyv8jZfr0bstC/Fn3KP+eu4L5b/YC+97j5P5USB8A4zKW/bUsrQIM1JD8JLei+gAGmvgYmYLzfy6u8NHhcPeKNEb8L76E+16wMQRXq1cCYv+c/TpmxP+5eA8HAV59Az/hIwZSTDcEPad6/USj3v8A64r/RezbA5XIgwOjkjz8Lo6g/q2S5P/f9gL2ZOPK+T5g2QOr/RT8XlN0/NSirP2+2sj9tble/DI55voAcPb8H5Za/2cngP19qyz9Yi/C/VMtkP17LQL9Y7VfAto/SP2o2HT+QHlzAUsDMv9WV3D/ARqm/8MHwvw=="],"bias":["9UrcPjOeFj4IClU/kVblvJ6b6LyuoN6+XNk4PjgY+D4="]},"dense_layer2":{"weights":["Qm7SPoKS5b+Gm4W/UtpyPeAJS75/0I8/wIz9PzR+gT/u/Qq/peQ/v2ndl79Vn2Y/+Mi1v4HDVT9KOy0/MBd/viACkL2l1kA/bVezve0/lT/WBrA/GqJPvlSpKT9BmTnAJtIRv71+Pb++umE/T3Lovr5E7j6Wd8o/tWa6vzSsuz9USNq+sRv+v4S4kb4WEPW/AxrMv+7T4r8Xwn6/jxqXvoAD1r3B3eu/rkUCwDNsB0CGdjW/BQGxP15E178Vza280RyGvtTJ1T8lMIi+ZO4fP4QeBr0brDM/Qp5lwBb0cr8/9ri+J0XtPtan7j93Vlk/rtYUwBGfQj+YtB8/M6gpvQ=="],"bias":["AAAAAG55Rj/9r749mSkTPyAvgD/NrAY/oFNeP6WYpj8="]},"dense_layer3":{"weights":["0DU2PSpB9D7oMRI+GqEbvlHJDb/ryPq+XFKIvvwQx76PxjI/m8PWviEsZcDWiii/2jOhP4xZtj8kT5U/3L59P82Cxz3LYA8++V+WP+rEgj0Fsm0/knQ+P+UHOL/1YoE/rQm7Pq7kfL5MHVE/zZS/PwlVd75UcOHAhmo7PwHzpj+fOAc/am3ev/rCpL+Tt5g/l0V5v8czGb++9PE+RAyhv71GRz9Usbe+N2Qpv0jlLj+8bHo+5ZMnwdApsb9b27e/nBMmv8NlHj/wko+/xVgNP4fXY79ZHpU+1aPsvgfckT4DD8o+q5x/P8dmycCVgy6/T77sPnaH9L+WsuM/29rMPQ=="],"bias":["S8IlwMNZG8Cb+Jo/SiCQPh4iwD+O4XO/dfoHP2joWTw="]},"dense_layer4":{"weights":["XX5HQNEqKEA89Eg/iICQv5uDmb9mJuI/fBAgwFX1xz9xCRPA1ffdPhXoNkCKYj3A4nu4wH9W2D9Zt/zAMqhFwGGqv78065Y7mzhfvQnuv76q6GY9qXeiPW1Per8SE2A/dLYiP5kfoL5InP291S62PrPFhz/a6UzAXKgcP4v1Lz2mZD+/vG1Dv+1zfD94Wec64+7vvgd5R770aFE/QYRbvxMuqj+/nJ+/0NCSvzwdYsDqcerADwtjP1x+JcHkf5rBAcsvv1wcNL9FgXG+Y/ctwFbc4z5aAvQ+2tmMv64WxL5vkok/nTJ0P5xYNj+DOas/IoD6PvR+cz4UCAi/JOeIPw=="],"bias":["SRDivwArkb7IGUM/oDNav32UNT7o6JzAbSGCvfhp7L8="]},"output":{"weights":["lundvvywK7+Ynuo+txKKvmeloL6+d2a/ZEqlvjbaOr4="],"bias":["B1SiPg=="]}},"hash":"22ec64570b9e14fa56d6a7245418a2595d0f3a2205da1d8b6cc796c919d89a58"}