{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-DNN_photonID_JetHT18RunBC_EGamma18RunC_SMSGlGl_StandardNorm_shape_1000epochs_large8","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,5],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Normalization","config":{"name":"normalization_layer","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":[-1],"invert":false,"mean":[0.01918871019884568,0.0241299883052034,-2.0546947000580692e-05,0.03101029050320906,0.010682534247841732],"variance":[0.00012243065118303526,0.00034772036293197086,2.931247871853659e-07,0.0003112402344346027,3.361905933521087e-05]},"registered_name":null,"build_config":{"input_shape":[null,5]},"name":"normalization_layer","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5]},"name":"dense_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5],"dtype":"float32","keras_history":["normalization_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer3","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer3","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer4","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer4","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer3",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer4",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[5]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[5],"values":["DpaGv6J3j78k/xu/oCyzP4gM1D4="]}],"outputs":[{"shape":[1],"values":["R8nvPg=="]}]}],"trainable_params":{"normalization_layer":{"mean":["pDGdPEGsxTw8XKy3Swn+PMwFLzw="],"variance":["umAAOT1OtjnEXp009S2jOTECDTg="]},"dense_layer0":{"weights":["WvsWPj7/hb7ecys/BJd9v5chbL86kES+2VFqvgDHwz7bUYU/+atnPrt2f79Qm2I/1l6HPmNW5766jS4+kTpJPybxFD54d8A/gZuNPwqazL8a+zk/tdwZPP79AL5aKjy/p52/PnZXlz5hxSs9p+8fvd9TAr5EO56+ZbpGP1aZvT6FO4M/GCZmupKyHj6whoy8B/e3PYcXk79bFKa/WitZvg=="],"bias":["ZHSCvsJ75D47QSU+TWbePVCzF76a3J08q9g1PsUR474="]},"dense_layer1":{"weights":["wnRPv/GO+T7E+fY+beZNPzqNt79TLA2/u/GVvns/rz14gYs/6rCbv+gvO79klR8+zWM3PxSwST55N8M+NegAP5TDrz5XTj8/q0LVvUPo4D6zl2o+i9iGvRgXX7/Lhq6++k37PW28zD7HtC8/etzVPkxWX7+UKJU/vakQPqlrYD+Myrs9MgVBPlaqBL4fb7o+FfQWPxkFzL77xlA/AvyNPsSCVL3lw/w+zIJovofRLL8/eCY/ny35Phxj9D4h+AS/feZnv6ncEz/0PbO+10aIv1oqwb7sYnc8SuKiPbOjkz4efsw+qpvnvUPQ3747fOm85VfCvHuACL8quFo99XgXPw=="],"bias":["58VfPhMQM77zDIk/xztRPgKhEL/8O2O+n+8jv563hz4="]},"dense_layer2":{"weights":["ljJhvr4EBj4jUUK/4TiDPmNvA7/bvlu+OtQavrwiVr61RAC/xZ0cv+FhJD8xi4m+77UYvxq/9r0uvNq+Omi6vtnTW75Dol++wldxP+graT4uwq0+UWlXPzeMKD81cY4+KLYIPcSnkr9jtVU9AvpRP3bs2L46IFi//kXgvYJytb7Mqr+8jco2vvgpDD/St7i+2DD5PcozML9/97I+EbBOv0Lhm72y0rE+RdjOPl8reD7AfQi/uMl3vhV5rD9sH7u+KY63vcKpFj/T2Kq8HrOMv4BKaz3LSRM+exmMPZ+fXz4QrmC91zE4PzovOr6UXLo+LnmzviFiMz775SK++BMSPw=="],"bias":["ywXgvXxlLLz1OaG+BA4IP5++Mb2jNjQ/LlnBPc45cj8="]},"dense_layer3":{"weights":["JHFmPstwJb4mJ6++Yk2QPpJpAb8Ez6m+jvLUvg7EGDwUKYO/sSc/v+zygD8t1vK95+KPPoX/LT8l+zU+pERkvhJGMr3E9Qg/f8j0v4wPl73nTZs9d9Siv6YlM7+FMHo++jYbPwiCDb7f1LM+xnKrPupoB7+s9oe+qOxFPxCNY7/5qN6+CgOVvjI83j5HuG8+OybhPguCGj+mkhE/tqqGPU666j53Sii/h8jqPWvR8D1LB5u+NhmEv4EIGD/tAlQ/FjBevZDtE74KMhvAE26EP7XHyj5SnMo+yGamPtpKcL4vjHY+f5ecP7IZ9r5VU3y/MFzxPrWg3r3+tlA/QhZHPw=="],"bias":["B2n1PrURCb+OUAS/uacBPovS3T73cMU+WsuXPtVTgzw="]},"dense_layer4":{"weights":["rV1WvXZMrL5kS389i6sCP1k54z5RGpk+dTQzP4bhHz6xFxM+MnLlvfQU0T7PXEC/UTquvhIXg78rWH49s40JwKvG9j4iKua+sC2FPwKfx76MfZy/d3W+v4WLfz+CLiK/81URvwxqnj3uJBY9zLMhvlSQST6PdZA+ZYYgv4ioYD0ajrS9QeP+vq41Rj65r/e+B6vAPdn0wz0wqB2/nJKUvrQF3j4fohy/xMMyPrrvbL97Fos/1xHFvzJNgD+upoI/bt3EvnamxjyN7+a+cOpdv+OB/L56ljS/O3AlP0SLzL9w3R+9luRaPlTsRD/XtXm+n/f8PiIqib6uamy/zKC6vQ=="],"bias":["cJKIvdNNlr0/VNM9ge4HP3stCT8iZCA/AHKZPhoU1j4="]},"output":{"weights":["3RXYPtBGAz7KS4W9qWLxvlHt477RYwq/zRypPmLO1L4="],"bias":["UuIBvg=="]}},"hash":"7b83738b91b6f8564addf6d501bcb726608b8333a6d8a72f2cab048b1f9d7635"}