{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-DNN_photonID_relIso_isoShape_500epochs_med16","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,10],"dtype":"float32","sparse":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"dense_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"dense_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,16],"dtype":"float32","keras_history":["dense_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"dense_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,16],"dtype":"float32","keras_history":["dense_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,16],"dtype":"float32","keras_history":["dense_layer2",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[10]],"output_shapes":[[2]],"tests":[{"inputs":[{"shape":[10],"values":["DgB8vQrLGEBQ/JI/2E3vvlBKmT9n146+iqLrvpsjC7/JCp6/IQi0Pw=="]}],"outputs":[{"shape":[2],"values":["AAAAAAAAgD8="]}]}],"trainable_params":{"dense_layer0":{"weights":["7bMzv9erqj/C7Pu+8zAhwMqiZL9u2FBAISsgvnsHcT4OkSA+O+K3PlglU78MxwxAn+jTP4IGYT74GPu9UNgoQK7xQL+sIpi+McjVvShdfT9Ft16/SFSMP7zJRb+nw/m+LtINv3RCxj6H/GG/i+UivzOUqT+KKV2/4D9OPcD3uL9V4uw9xFFkPnJbtrxpccE+r6IOPY+ZAD6lx0A9cPslPkGlhL3u/AK++klIvLGlDroffmq+S1mkPk4czL5prXQ++Jc2PWwqnz4P86A+orOUv0nsbT8cFFc7ssU4PgsyrT5N7Cg/qROzvnXtNryoqlq/Za+Pv/mLaT5w2I49EL8Jv7Xuvz4ARBk+u/VxvUnJuL9hYqY/R3rGvwaXwz5dAzi+15whPt54h7uYG9Q/9TWevwbLLUAz9AM/L9O0vneWab8HhaO9i2YQwXOSgL5Y5/27QcXEPpnasr12iTvAU466P5FfSz4BKIa9mpWYv2vmlT8RX6m+w5K4vowqgD4qlp6+ESKhwkGtJMLMUoFCz7ObQfPFDcHKqKFBGTgewtsOEcLAUOfBdP+7QGF4PsFL5rZB1MBmQeJaF0BsBQq+G2mrQaRBe8BOdpjBAFcvQVsm18Dt6GZBbt0XwUsFbUDcYHZAgyU3QTkzisC8bU9BeEwZwKdHo8BABjpBgIjAu3Kca0Elb4XAI/HGPxrWuj7obwo/mEzKwACYIj8c0hW90/yRvnM0mMErxRXDYKkMQNVAUUB37Ku9d/cPQPhoDT5vWSpA6eikv7PnMT9cLTtA3punPZfyJr+7CX++2c9/QJ1rPz8NNzw/D51YPtybI0BRNvE/KvvvvbZbVMEThnu+Ag+Tvw=="],"bias":["13U6PaoKdD1ALg89/ky0Pb3JTT34UQy+zbO1PO6nkb3PnNo9GrRPPjpyQD3VqQG+A96WPYZ+z7wAAAAAAHxUvA=="]},"dense_layer1":{"weights":["SGPiv94yDUCSKiK+2PGlPqtht7+wBhzAcNpVvz1hRUDga6rAmar+PFMBkD9q5QVAjgwEwM3gdT5qu/U9GidZwE2q1j9kg+m/ULq8v+cglD80g5G/R/sAP8JuhD9EkeC+BX2oP9e1mr6q65O/TXO2P5t2Kb9p544+3KHRvpUWQT5Pq2Y94wX6v2C1Vj4hg2c/XAaPP95NJD6oetC/5u2WwBpWuj5iaOO+0yWCwGv9uMB2lhpA44FIvi4tTr/rtGC+a5uAP/4HNL+SoDA+l0VIvihoRTx0lJw/USaDPwLVzL5s/6U/P2cQvRKL/DugwHM+WejGPq55Xr49Fzy/i5MrP0FJG8CxRwg//B3fP1QWqL9/c4E+HebKvy3Y1L/16nM/p/9rPyRbqb53DqQ+s2k+v6WCgr42IxA+9xzAP4XGh7+nLVo+wGoGwLYT9jzmuSDAf1jnPpGSjj/B54k/ADDcPhvLLT+aqLm+I6+Gv8Z0IT5Tdzw++Gbcvive57+9tRhAyEXZPdUFxr/YnYe/tVPqvz9kor+mMm29HPl0vwrC1r/wYRw+jK8uPuCd0b/GRF6/msh8v1N0sr5+GqI+BADlv282AcBWWrg/z6mDP6r4jj6/OuW+H4+lvzKMKsBYzIE/HJeqvoNjVj6tIcs/jfxov2XPDMCoqX2+disQvrA3CMDtHfy/rcChPjam3T/1LyQ/h3wwwM17T8AMblm/5XqGv1R+Zz/QVyI9cwaPwIJVPb6E3yXAu8Tbvk3zB0B8lzLAPCieQBN1Zr/FO09AEsugP/A4pMBOjTFANzuTP5NBUj8tizFACrXkvbUd/r0F+JM+j9qaPx2Cuz5L54XAKSTxvzjOar8C5v2/mcruvhPcm7+0vOE+ZosVviugDMC4NgDAZjH6PgGrxb4Mgem+SKw7v7ymXD0SRk2+SRimPy9JHL9daFw/eN9vPXprjT+ciJq/7W19P1bbRD8P3pK/ei3LPublZD98W9S8QUqRv8RhOz8rosQ8dGDiPNZvmz1u9gs/","jGP7Pys5nD9hFZO9xYZUwHn7FD+QP/M/i3u7PxY0m75tces/eTgvPhQElj5iD0y9LUE4P4gtxr56IMi/ofeAP3fEgb+0ZaI/haBHv3soTr3M/AQ/q6Duv8WUB0Alkhq/qlskP1oB3r5StYA/avYCQHKtOj+x/FW+KEKqPstI6r3SyzM+Ep98PsSU3z3mL2c+O8WvPoXmtz4gmku8X82UPnmFmz6IsZu+imMVPh1Svj5iPnU+1xejPna/ob4yEDU+y6gjP4M45j/NtQS/OmqrvXq57b1j71K/tVkSPeogAcA6wm8+kUajvn3CmT8CBXa/pqWCP5n2AD6wGSa8HgXpvQ=="],"bias":["Ww3hvA7tSD4+1ek9qT0fPy+BFT9sYc0+IVP5vf0fHT/23sy/Zt8+vmL/Fj/ZVpy+zChDvbfeU71OQ0Y/V/w7Pw=="]},"dense_layer2":{"weights":["RDxAv9hmdr5P6Kw/0l0pv0Rx1j092ne9dObrP2hhvz1rSLk+VP++vpLss7+S9kQ+/z/oP+5Aib+VWJ8/SnSnvhExnz+Fm6PAyz7lv+G0RD5k3eQ9eNTaPuJYj75DBag/QT2HPSIVoD7G47k9edSZPkl3KsDPPH6/YMptP7dW8L/hVNw+vqP4vhSCtb8szqe/v9fsv7Q5VD4P9Ys/N2a4v00s5b5uf3a+igYMP/Sqlj72Zfu+2vaHP1sWp7//ez8/EFCnP7eCYT52IDm/Jy3nPvKVVT/YDA9AH09avzydVj+NnS+/sSnkPccgVD8Yel8+jMMjvr+3NrwX+9u8YZ0RPq0xOj6UEog/h2Ckv3TeCEC6GiXA+JOAvvlxfL6QCI2/pUwmwFJ3pL5H/FM/baslvwzJeD53oow+z9eev89CYD6PwwPAqORCP2rU2b78ITm+EQagPmAkoj9ho/a9lvPcP08Xyj79Ini+EUvuvxczJz6OOjM/Oo8Qvy/bg7+8qB8/wGmCP4rzsT9LXgg+Z63dvYlRVD8BgGs/mgKdv4VsmL8+Pf0+mPOCPqMPAUBg/KW/ALMYPzQIpD6sZHq/olrpPz3xl8B8vvs+cLHLP6q4XcClMo8/ulDgv2xqLj5USW4/W6xkP+/xub1jmhY/BG4Yvyb3xb9916a/dRqsPye5Tr+3xYi+KSwVP9nKEz+paia/AJs5voQOT7/2dIi//nr0v10wZL/DTIC+bQQcv6who705uvY9xU3xPzdF475LVdS+GMz0vVRYmT46zUI+sJamvmx1Ab6S0Ri+U6w3vSByOb7D7KK9ghyDvkrE8Twn+Nk+GmCyvi81DD61flM+IRczvjRcET48virAYuX5P2YEH79izFzAYuieP/nIB74edQQ+K4zvP5hVvL4vQ0fAIRWVPwHeQ78tJ7nABx8YvyU+b7zcGQ5Acd92wCOEgz8vf/u/QeMcQFmmq79e5vq+v5D4vjWSFD6CeBc+kAKhQJjFAEBmh9E/OYY8v6kJBUBN1YA/","6dANPxyRd7+J1g3A/mW6v2EadcCx94s+GXfiPhbnb7/mV3TAaKSyvp4QWD9hiX8+gTd9PwnuKb9k9mbAz0WFv4BECr1J7Hk+fT6VviDBYj2PIkG+BUDKPTd5fT1MqMu+3FWRPspgfD6HwbM+QbYLPh9X0j4WiXQ+b5RSva9ooD5atOI/jZ9ywASKBT560h8/XOYOP70pG8COCFW/InBuPbu+qr35zV89PnOtPqv6GL9J3LO+OaHBvjKViT+nd+8/jBOdv49oKz/1mpC8lMeIPwF++z66Er6+gJgRP+WFd77mbr8/UWraPDFYzT7YCD8/C8pHvxK0mMBTPDnAov3Lvw=="],"bias":["f/fZPqf7vD7Dimc/eV9XvrV6bT/6a8u+0NXYPi8EBz+NX/8+rfxKvgXviD6YZh2/ax8Yv5I0YT7m5Eo/cm0XPg=="]},"output":{"weights":["XDTPPri4yL5Gq1c+JONFv8SeZj89w6a+yURxv4G1ez9d62k+ZT9dvlPuV78w97w+0cFMvyVN+z6LQzw/uPqnvvJ2oD4o2BC+DH6TvqpwMj7MZgw/ibqqvjikPb9TRzw/2oANv/DpAD8ughS/nMcqPw4bKD9rdxC/hbjgPoudvL4="],"bias":["CE/FvblixT0="]}},"hash":"5bf7f444de8831152f9b6d50671d378b1e0d5d99130b75fca052223d97f0572a"}